rheoTool/tutorials/rheoFoam/CrossSlot/Oldroyd-BLog/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (-10 -0.5 0)
  (-0.5 -0.5 0)
  (-0.5 -10 0)
  (0.5 -10 0)
  (0.5 -0.5 0)
  (10 -0.5 0)
  (10 0.5 0)
  (0.5 0.5 0)
  (0.5 10 0)
  (-0.5 10 0)
  (-0.5 0.5 0)
  (-10 0.5 0) // 11

  (-10 -0.5 1) //12
  (-0.5 -0.5 1)
  (-0.5 -10 1)
  (0.5 -10 1)
  (0.5 -0.5 1)
  (10 -0.5 1)
  (10 0.5 1)
  (0.5 0.5 1)
  (0.5 10 1)
  (-0.5 10 1)
  (-0.5 0.5 1)
  (-10 0.5 1) // 21
  

);

blocks
(
    hex (0 1 10 11 12 13 22 23) (60 51 1) simpleGrading (0.04 1 1) //1
    hex (2 3 4 1 14 15 16 13) (51 60 1) simpleGrading (1 0.04 1) //2
    hex (4 5 6 7 16 17 18 19) (60 51 1) simpleGrading (25 1 1) //3
    hex (10 7 8 9 22 19 20 21) (51 60 1) simpleGrading (1 25 1) //4    
    hex (1 4 7 10 13 16 19 22) (51 51 1) simpleGrading (1 1 1) //8    

    
);

edges
(
);

boundary
(
   
  inlet_north
     {
      type patch;
      faces
      (
            (9 8 20 21)            
        );
    }
    
   inlet_south
    {
        type patch;
        faces
        (
            (2 3 15 14)           
        );
    }
    
    outlet_east
    {
        type patch;
        faces
        (
            (5 6 18 17)
             
            
        );
    }     
    
    outlet_west
    {
        type patch;
        faces
        (
            (0 11 23 12)
            
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 1 13 14)
            (3 4 16 15)
            (4 5 17 16)
            (7 6 18 19)
            (7 8 20 19)
            (10 9 21 22)
            (11 10 22 23)
                     
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 10 11)
            (2 3 4 1)
            (4 5 6 7)
            (10 7 8 9)
            (1 4 7 10)
            
            (12 13 22 23)
            (14 15 16 13)
            (16 17 18 19)
            (22 19 20 21)
            (13 16 19 22)
             
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
